'use strict';

// Частина №1

const year = +prompt('Вкажи рік народження');
const city = prompt('Вкажи назву міста, в якому проживаєш');
const sport = prompt('Вкажи улюблений вид спорту');


if(year && sport && (city === 'Київ' || city === 'Вашингтон' || city === 'Лондон') && (sport === 'бокс')) {
    alert(`Тобі ${2024 - year} років. Ти живеш у столиці ${city}. Круто! Хочеш стати Віталієм Кличком?`);
} else if(year && sport && (city === 'Київ' || city === 'Вашингтон' || city === 'Лондон') && (sport === 'футбол')) {
    alert(`Тобі ${2024 - year} років. Ти живеш у столиці ${city}. Круто! Хочеш стати Андрієм Шевченком?`);
} else if(year && sport && (city === 'Київ' || city === 'Вашингтон' || city === 'Лондон') && (sport === 'теніс')) {
    alert(`Тобі ${2024 - year} років. Ти живеш у столиці ${city}. Круто! Хочеш стати Еліною Світоліною?`);
} else if(year && city && (sport === 'бокс')) {
    alert(`Тобі ${2024 - year} років. Ти живеш у місті ${city}. Круто! Хочеш стати Віталієм Кличком?`);
} else if(year && city && (sport === 'футбол')) {
    alert(`Тобі ${2024 - year} років. Ти живеш у місті ${city}. Круто! Хочеш стати Андрієм Шевченком?`);
} else if(year && city && (sport === 'теніс')) {
    alert(`Тобі ${2024 - year} років. Ти живеш у місті ${city}. Круто! Хочеш стати Еліною Світоліною?`);
} else if(!year) {
    alert('Шкода, що Ви не захотіли ввести свій рік народження');
} else if(!city) {
    alert('Шкода, що Ви не захотіли ввести назву свого міста');
} else if(!sport) {
    alert('Шкода, що Ви не захотіли ввести улюблений вид спорту');
}